---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsHydraulicDiameterParam
source: html/0286b350-1dc3-7376-2478-0c2ec62491ab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsHydraulicDiameterParam Property

"Hydraulic Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsHydraulicDiameterParam { get; }
```